       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACTIVITE-BUSINESS.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LK-ACTIVITE.
           05 LK-ACTIVITE-ID PIC 9(9).
           05 LK-ACTIVITE-NOM PIC X(50).
           05 LK-ACTIVITE-TYPE PIC X(20).
           05 LK-ACTIVITE-IDANTENNE PIC 9(9).
           05 LK-ACTIVITE-ANIMATEUR PIC 9(9).
           05 LK-ACTIVITE-NBPART PIC 9(9).
           05 LK-ACTIVITE-TRANSPORT PIC 9(2).
           05 LK-ACTIVITE-LIEU PIC X(100).
           05 LK-ACTIVITE-DISTANCE PIC 9(10).
           05 LK-ACTIVITE-HEBERG PIC 9(1).
           05 LK-ACTIVITE-REPAS PIC 9(1).
           05 LK-ACTIVITE-EMPREINTE PIC S9(9)V9(4).
           05 LK-ANTENNE-NOM PIC X(50).
           05 LK-ANTENNE-REGION PIC X(50).
           05 LK-USER-NOM PIC X(50).
           05 LK-USER-MAIL PIC X(80).
       PROCEDURE DIVISION USING LK-ACTIVITE.
       DISPLAY-ACTIVITE.
           DISPLAY '----------------------------------------'
           DISPLAY 'ACTIVITE : ' LK-ACTIVITE-NOM
           DISPLAY 'ID       : ' LK-ACTIVITE-ID
           DISPLAY 'TYPE     : ' LK-ACTIVITE-TYPE
           DISPLAY 'ANTENNE  : ' LK-ANTENNE-NOM
           DISPLAY 'REGION   : ' LK-ANTENNE-REGION
           DISPLAY 'ANIMATEUR: ' LK-USER-NOM
           DISPLAY 'EMAIL    : ' LK-USER-MAIL
           DISPLAY 'LIEU     : ' LK-ACTIVITE-LIEU
           DISPLAY 'DISTANCE : ' LK-ACTIVITE-DISTANCE
           DISPLAY 'TRANSPORT: ' LK-ACTIVITE-TRANSPORT
           DISPLAY 'HEBERG.  : ' LK-ACTIVITE-HEBERG
           DISPLAY 'REPAS    : ' LK-ACTIVITE-REPAS
           DISPLAY 'EMPREINTE: ' LK-ACTIVITE-EMPREINTE
           DISPLAY '----------------------------------------'
           GOBACK.