```json
[
"DISPLAY '=========================================='",
"DISPLAY 'DEBUT TRAITEMENT BATCH REPAS'",
"DISPLAY '=========================================='",
"INITIALIZE WS-COUNT-TOTAL",
"INITIALIZE WS-COUNT-ERROR",
"MOVE 'N' TO END-OF-FILE",
"MOVE 'READ' TO OPERATION",
"CALL 'REPAS-DAL-DB' USING OPERATION END-OF-FILE REPAS",
"END-CALL",
"PERFORM UNTIL END-OF-FILE EQUAL 'Y'",
"ADD 1 TO WS-COUNT-TOTAL",
"PERFORM CALCULATE-REPAS",
"MOVE 'SAVE' TO OPERATION",
"CALL 'REPAS-DAL-DB' USING OPERATION END-OF-FILE REPAS",
"END-CALL",
"CALL 'REPAS-BUSINESS' USING REPAS",
"END-CALL",
"MOVE 'READ' TO OPERATION",
"CALL 'REPAS-DAL-DB' USING OPERATION END-OF-FILE REPAS",
"END-CALL",
"END-PERFORM",
"MOVE 'END ' TO OPERATION",
"CALL 'REPAS-DAL-DB' USING OPERATION END-OF-FILE REPAS",
"END-CALL",
"DISPLAY '=========================================='",
"DISPLAY 'FIN TRAITEMENT BATCH REPAS'",
"DISPLAY 'Nombre repas traites: ' WS-COUNT-TOTAL",
"DISPLAY 'Repas en erreur: ' WS-COUNT-ERROR",
"DISPLAY '=========================================='",
"STOP RUN"
]
```