      *> Record structure for ANTENNE
       01 ANTENNE.
           05 ANTENNE-ID           PIC 9(9).
           05 ANTENNE-NOM          PIC X(50).
           05 ANTENNE-REGION       PIC X(50).