      *> Record structure for HEBERGEMENT
       01 HEBERGEMENT.
           05 HEBERGEMENT-ID       PIC 9(9).
           05 HEBERGEMENT-ID-ACTIVITE PIC 9(9).
           05 HEBERGEMENT-TYPE     PIC 9(2).
           05 HEBERGEMENT-NBNUIT   PIC S9(3).