      *> Record structure for UTILISATEUR
       01 UTILISATEUR.
           05 USER-ID              PIC 9(9).
           05 USER-NOM             PIC X(50).
           05 USER-MAIL            PIC X(80).
           05 USER-PASS            PIC X(256).
           05 USER-ROLE            PIC X(15).
           05 USER-ID-ANTENNE      PIC 9(9).
           05 USER-LAST-LOGIN      PIC S9(11).