```json
[
"MOVE LK-ACTIVITE-ID TO WS-ACTIVITE-ID.",
"MOVE LK-ACTIVITE-EMPREINTE TO WS-ACTIVITE-EMPREINTE.",
"EXEC SQL",
"UPDATE ACTIVITE",
"SET ACTIVITE_EMPREINTETOTALE = :WS-ACTIVITE-EMPREINTE",
"WHERE ACTIVITE_ID = :WS-ACTIVITE-ID",
"END-EXEC.",
"IF SQLCODE NOT EQUAL ZERO",
"DISPLAY 'ERREUR UPDATE: SQLCODE=' SQLCODE",
"EXEC SQL ROLLBACK END-EXEC",
"GOBACK",
"END-IF."
]
```