      * EMPLOYEE-RECORD.cpy - Structure de données pour EMPLOYEE
       01 EMPLOYEE.
           05 EMP-ID          PIC 9(4).
           05 EMP-NAME        PIC A(30).
           05 SALARY-BRUT     PIC S9(6)V99.
           05 SALARY-NET      PIC S9(6)V99.
