      *> Record structure for PARTICIPATION
       01 PARTICIPATION.
           05 PARTICIPATION-ID-ACTIVITE PIC 9(9).
           05 PARTICIPATION-ID-USER PIC 9(9).
           05 PARTICIPATION-MODE-TRANSPORT PIC S9(2).