      *> Record structure for REPAS
       01 REPAS.
           05 REPAS-ID             PIC 9(9).
           05 REPAS-ID-ACTIVITE    PIC 9(9).
           05 REPAS-TYPE           PIC 9(2).
           05 REPAS-NBREPAS        PIC S9(5).