       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-NET-SALARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-END-OF-FILE         PIC X VALUE 'N'.
       01  WS-EMPLOYEE.
           05  WS-EMP-ID          PIC 9(4).
           05  WS-EMP-NAME        PIC X(30).
           05  WS-SALARY-BRUT     PIC 9(6)V99.
           05  WS-SALARY-NET      PIC 9(6)V99.
       01  WS-TAX-RATE            PIC 9V99 VALUE 0.20.
       01  WS-TAX-AMOUNT          PIC 9(6)V99.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           PERFORM INIT-DAL
           PERFORM UNTIL WS-END-OF-FILE = 'Y'
               PERFORM READ-EMPLOYEE
               IF WS-END-OF-FILE = 'N'
                   PERFORM CALCULATE-NET
                   PERFORM DISPLAY-EMPLOYEE
                   PERFORM SAVE-EMPLOYEE
               END-IF
           END-PERFORM
           PERFORM END-DAL
           GOBACK.

       INIT-DAL.
           CALL 'EMPLOYEE-DAL' USING 'INIT' WS-END-OF-FILE WS-EMPLOYEE.

       READ-EMPLOYEE.
           CALL 'EMPLOYEE-DAL' USING 'READ' WS-END-OF-FILE WS-EMPLOYEE.

       CALCULATE-NET.
           COMPUTE WS-TAX-AMOUNT = WS-SALARY-BRUT * WS-TAX-RATE
           COMPUTE WS-SALARY-NET = WS-SALARY-BRUT - WS-TAX-AMOUNT.

       DISPLAY-EMPLOYEE.
           CALL 'DISPLAY-EMPLOYEE' USING WS-EMPLOYEE.

       SAVE-EMPLOYEE.
           CALL 'EMPLOYEE-DAL' USING 'SAVE' WS-END-OF-FILE WS-EMPLOYEE.

       END-DAL.
           CALL 'EMPLOYEE-DAL' USING 'END ' WS-END-OF-FILE WS-EMPLOYEE.