       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISPLAYEMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-EOF                 PIC X VALUE 'N'.
OCESQL*
       LINKAGE SECTION.
       01 LK-EMPLOYEE.
           05 LK-EMPID           PIC 9(4).
           05 LK-EMPNAME         PIC X(30).
           05 LK-SALARYBRUT      PIC 9(6)V99.
           05 LK-SALARYNET       PIC 9(6)V99.
       PROCEDURE DIVISION USING LK-EMPLOYEE.
       MAIN.
           DISPLAY "ID: " LK-EMPID.
           DISPLAY "NOM: " LK-EMPNAME.
           DISPLAY "SALAIRE BRUT: " LK-SALARYBRUT.
           DISPLAY "SALAIRE NET: " LK-SALARYNET.
           EXIT PROGRAM.