```json
[
"DISPLAY '=========================================='",
"DISPLAY 'DEBUT TRAITEMENT BATCH UTILISATEURS'",
"DISPLAY '=========================================='",
"INITIALIZE WS-COUNT-TOTAL",
"INITIALIZE WS-COUNT-ERROR",
"MOVE 'N' TO END-OF-FILE",
"MOVE 'READ' TO OPERATION",
"CALL 'UTILISATEUR-DAL-DB' USING OPERATION END-OF-FILE UTILISATEUR",
"PERFORM UNTIL END-OF-FILE = 'Y'",
"ADD 1 TO WS-COUNT-TOTAL",
"PERFORM CALCULATE-LOGIN",
"MOVE 'SAVE' TO OPERATION",
"CALL 'UTILISATEUR-DAL-DB' USING OPERATION END-OF-FILE UTILISATEUR",
"CALL 'UTILISATEUR-BUSINESS' USING UTILISATEUR",
"MOVE 'READ' TO OPERATION",
"CALL 'UTILISATEUR-DAL-DB' USING OPERATION END-OF-FILE UTILISATEUR",
"END-PERFORM",
"MOVE 'END ' TO OPERATION",
"CALL 'UTILISATEUR-DAL-DB' USING OPERATION END-OF-FILE UTILISATEUR",
"DISPLAY '=========================================='",
"DISPLAY 'FIN TRAITEMENT BATCH UTILISATEURS'",
"DISPLAY 'Nombre utilisateurs traites: ' WS-COUNT-TOTAL",
"DISPLAY 'Utilisateurs en erreur: ' WS-COUNT-ERROR",
"DISPLAY '=========================================='",
"STOP RUN"
]
```