```json
[
"DISPLAY '=========================================='",
"DISPLAY 'DEBUT TRAITEMENT BATCH HEBERGEMENTS'",
"DISPLAY '=========================================='",
"INITIALIZE WS-COUNT-TOTAL WS-COUNT-ERROR",
"MOVE 'N' TO END-OF-FILE",
"MOVE 'READ' TO OPERATION",
"CALL 'HEBERGEMENT-DAL-DB' USING OPERATION END-OF-FILE HEBERGEMENT",
"PERFORM UNTIL END-OF-FILE = 'Y'",
"ADD 1 TO WS-COUNT-TOTAL",
"PERFORM CALCULATE-HEBERGEMENT",
"MOVE 'SAVE' TO OPERATION",
"CALL 'HEBERGEMENT-DAL-DB' USING OPERATION END-OF-FILE HEBERGEMENT",
"CALL 'HEBERGEMENT-BUSINESS' USING HEBERGEMENT",
"MOVE 'READ' TO OPERATION",
"CALL 'HEBERGEMENT-DAL-DB' USING OPERATION END-OF-FILE HEBERGEMENT",
"END-PERFORM",
"MOVE 'END ' TO OPERATION",
"CALL 'HEBERGEMENT-DAL-DB' USING OPERATION END-OF-FILE HEBERGEMENT",
"DISPLAY '=========================================='",
"DISPLAY 'FIN TRAITEMENT BATCH HEBERGEMENTS'",
"DISPLAY 'Nombre hebergements traites: ' WS-COUNT-TOTAL",
"DISPLAY 'Hebergements en erreur: ' WS-COUNT-ERROR",
"DISPLAY '=========================================='",
"STOP RUN"
]
```