       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPAS-DAL-DB.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
OCESQL*    EXEC SQL INCLUDE SQLCA END-EXEC.
OCESQL     copy "sqlca.cbl".
       01  WS-CONNECTED-FLAG      PIC X VALUE 'N'.
       01  WS-CURSOR-OPEN-FLAG    PIC X VALUE 'N'.
       01  WS-REPAS-ID            PIC 9(9).
       01  WS-REPAS-ID-ACTIVITE   PIC 9(9).
       01  WS-REPAS-TYPE          PIC 9(2).
       01  WS-REPAS-NBREPAS       PIC S9(5).
       01  WS-DB-NAME             PIC X(64).
       01  WS-DB-USER             PIC X(64).
       01  WS-DB-PASSWORD         PIC X(64).
       
       
OCESQL*
OCESQL 01  SQ0001.
OCESQL     02  FILLER PIC X(090) VALUE "SELECT REPAS_ID, REPAS_ID_ACTI"
OCESQL  &  "VITE, REPAS_TYPE, REPAS_NBREPAS FROM REPAS ORDER BY REPAS_"
OCESQL  &  "ID".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0002.
OCESQL     02  FILLER PIC X(096) VALUE "UPDATE REPAS SET REPAS_ID_ACTI"
OCESQL  &  "VITE = $1, REPAS_TYPE = $2, REPAS_NBREPAS = $3 WHERE REPAS"
OCESQL  &  "_ID = $4".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0003.
OCESQL     02  FILLER PIC X(014) VALUE "DISCONNECT ALL".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
       LINKAGE SECTION.
       01 LK-OPERATION            PIC X(4).
       01 LK-END-OF-FILE          PIC X.
       01 LK-REPAS.
           05 LK-REPAS-ID PIC 9(9).
           05 LK-REPAS-ID-ACTIVITE PIC 9(9).
           05 LK-REPAS-TYPE PIC 9(2).
           05 LK-REPAS-NBREPAS PIC S9(5).
       
       PROCEDURE DIVISION USING LK-OPERATION LK-END-OF-FILE LK-REPAS.
       MAIN-ENTRY.
           EVALUATE LK-OPERATION
               WHEN 'END '
                   PERFORM DAL-END
               WHEN 'READ'
                   PERFORM DAL-READ
               WHEN 'SAVE'
                   PERFORM DAL-SAVE
               WHEN OTHER
                   DISPLAY 'ERREUR: Operation inconnue: ' LK-OPERATION
           END-EVALUATE
           GOBACK
           .
       
       DAL-CONNECT.
           IF WS-CONNECTED-FLAG = 'Y'
               CONTINUE
           ELSE
               ACCEPT WS-DB-USER FROM ENVIRONMENT 'PGUSER'
               ACCEPT WS-DB-PASSWORD FROM ENVIRONMENT 'PGPASSWORD'
               ACCEPT WS-DB-NAME FROM ENVIRONMENT 'PGDATABASE'
OCESQL*        EXEC SQL
OCESQL*            CONNECT :WS-DB-USER IDENTIFIED BY :WS-DB-PASSWORD
OCESQL*            USING :WS-DB-NAME
OCESQL*        END-EXEC
OCESQL     CALL "OCESQLConnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE WS-DB-USER
OCESQL          BY VALUE 64
OCESQL          BY REFERENCE WS-DB-PASSWORD
OCESQL          BY VALUE 64
OCESQL          BY REFERENCE WS-DB-NAME
OCESQL          BY VALUE 64
OCESQL     END-CALL
               IF SQLCODE < ZERO
                   DISPLAY 'ERREUR CONNECT: SQLCODE=' SQLCODE
                   DISPLAY 'SQLSTATE=' SQLSTATE
                   DISPLAY 'SQLERRMC=' SQLERRMC
                   GOBACK
               ELSE
                   DISPLAY 'Connexion DB reussie'
                   MOVE 'Y' TO WS-CONNECTED-FLAG
               END-IF
           END-IF
           .
       
       DAL-READ.
           PERFORM DAL-CONNECT
           IF WS-CURSOR-OPEN-FLAG NOT EQUAL 'Y'
OCESQL*        EXEC SQL
OCESQL*            DECLARE C_REP CURSOR FOR
OCESQL*            SELECT REPAS_ID, REPAS_ID_ACTIVITE, REPAS_TYPE,
OCESQL*                   REPAS_NBREPAS
OCESQL*            FROM REPAS
OCESQL*            ORDER BY REPAS_ID
OCESQL*        END-EXEC
OCESQL     CALL "OCESQLCursorDeclare" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "REPAS_DAL_DB_C_REP" & x"00"
OCESQL          BY REFERENCE SQ0001
OCESQL     END-CALL
OCESQL*        EXEC SQL OPEN C_REP END-EXEC
OCESQL     CALL "OCESQLCursorOpen" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "REPAS_DAL_DB_C_REP" & x"00"
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR OPEN: SQLCODE=' SQLCODE
                   GOBACK
               ELSE
                   DISPLAY 'Curseur C_REP ouvert'
                   MOVE 'Y' TO WS-CURSOR-OPEN-FLAG
               END-IF
           END-IF
       
           MOVE 'N' TO LK-END-OF-FILE
OCESQL*    EXEC SQL
OCESQL*        FETCH C_REP INTO
OCESQL*            :WS-REPAS-ID,
OCESQL*            :WS-REPAS-ID-ACTIVITE,
OCESQL*            :WS-REPAS-TYPE,
OCESQL*            :WS-REPAS-NBREPAS
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-ID
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-ID-ACTIVITE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-TYPE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 5
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-NBREPAS
OCESQL     END-CALL
OCESQL     CALL "OCESQLCursorFetchOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "REPAS_DAL_DB_C_REP" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
       
           EVALUATE SQLCODE
               WHEN 0
                   MOVE WS-REPAS-ID TO LK-REPAS-ID OF LK-REPAS
                   MOVE WS-REPAS-ID-ACTIVITE TO
                       LK-REPAS-ID-ACTIVITE OF LK-REPAS
                   MOVE WS-REPAS-TYPE TO LK-REPAS-TYPE OF LK-REPAS
                   MOVE WS-REPAS-NBREPAS TO LK-REPAS-NBREPAS OF LK-REPAS
               WHEN 100
                   MOVE 'Y' TO LK-END-OF-FILE
               WHEN OTHER
                   DISPLAY 'ERREUR FETCH: SQLCODE=' SQLCODE
                   MOVE 'Y' TO LK-END-OF-FILE
           END-EVALUATE
           .
       
       DAL-SAVE.
           PERFORM DAL-CONNECT
           MOVE LK-REPAS-ID OF LK-REPAS TO WS-REPAS-ID
           MOVE LK-REPAS-ID-ACTIVITE OF LK-REPAS TO WS-REPAS-ID-ACTIVITE
           MOVE LK-REPAS-TYPE OF LK-REPAS TO WS-REPAS-TYPE
           MOVE LK-REPAS-NBREPAS OF LK-REPAS TO WS-REPAS-NBREPAS
       
OCESQL*    EXEC SQL
OCESQL*        UPDATE REPAS
OCESQL*        SET REPAS_ID_ACTIVITE = :WS-REPAS-ID-ACTIVITE,
OCESQL*            REPAS_TYPE = :WS-REPAS-TYPE,
OCESQL*            REPAS_NBREPAS = :WS-REPAS-NBREPAS
OCESQL*        WHERE REPAS_ID = :WS-REPAS-ID
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-ID-ACTIVITE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-TYPE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 5
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-NBREPAS
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-REPAS-ID
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0002
OCESQL          BY VALUE 4
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
       
           IF SQLCODE NOT EQUAL ZERO
               DISPLAY 'ERREUR UPDATE: SQLCODE=' SQLCODE
           END-IF
           .
       
       DAL-END.
           IF WS-CURSOR-OPEN-FLAG = 'Y'
OCESQL*        EXEC SQL CLOSE C_REP END-EXEC
OCESQL     CALL "OCESQLCursorClose"  USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "REPAS_DAL_DB_C_REP" & x"00"
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR CLOSE: SQLCODE=' SQLCODE
               END-IF
               MOVE 'N' TO WS-CURSOR-OPEN-FLAG
           END-IF
       
           IF WS-CONNECTED-FLAG = 'Y'
OCESQL*        EXEC SQL COMMIT END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "COMMIT" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR COMMIT: SQLCODE=' SQLCODE
               END-IF
OCESQL*        EXEC SQL DISCONNECT ALL END-EXEC
OCESQL     CALL "OCESQLDisconnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR DISCONNECT: SQLCODE=' SQLCODE
               END-IF
               DISPLAY 'Fermeture connexion'
               MOVE 'N' TO WS-CONNECTED-FLAG
           END-IF
           .