       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACTIVITE-BUSINESS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LK-ACTIVITE.
          05 LK-ACTIVITE-ID           PIC 9(9).
          05 LK-ACTIVITE-NOM           PIC X(50).
          05 LK-ACTIVITE-TYPE          PIC X(20).
          05 LK-ACTIVITE-IDANTENNE     PIC 9(9).
          05 LK-ACTIVITE-ANIMATEUR     PIC 9(9).
          05 LK-ACTIVITE-NBPART        PIC 9(9).
          05 LK-ACTIVITE-TRANSPORT     PIC 9(2).
          05 LK-ACTIVITE-LIEU          PIC X(100).
          05 LK-ACTIVITE-DISTANCE      PIC 9(10).
          05 LK-ACTIVITE-HEBERG        PIC 9(1).
          05 LK-ACTIVITE-REPAS         PIC 9(1).
          05 LK-ACTIVITE-EMPREINTE     PIC S9(9)V9(4).
          05 LK-ANTENNE-NOM            PIC X(50).
          05 LK-ANTENNE-REGION         PIC X(50).
          05 LK-USER-NOM               PIC X(50).
          05 LK-USER-MAIL              PIC X(80).
       PROCEDURE DIVISION USING LK-ACTIVITE.
       DISPLAY-ACTIVITE.
           DISPLAY '----------------------------------------'
           DISPLAY 'ACTIVITE : ' LK-ACTIVITE-NOM OF LK-ACTIVITE
           DISPLAY 'ID       : ' LK-ACTIVITE-ID OF LK-ACTIVITE
           DISPLAY 'TYPE     : ' LK-ACTIVITE-TYPE OF LK-ACTIVITE
           DISPLAY 'ANTENNE  : ' LK-ANTENNE-NOM OF LK-ACTIVITE
           DISPLAY 'REGION   : ' LK-ANTENNE-REGION OF LK-ACTIVITE
           DISPLAY 'ANIMATEUR: ' LK-USER-NOM OF LK-ACTIVITE
           DISPLAY 'EMAIL    : ' LK-USER-MAIL OF LK-ACTIVITE
           DISPLAY 'LIEU     : ' LK-ACTIVITE-LIEU OF LK-ACTIVITE
           DISPLAY 'DISTANCE : ' LK-ACTIVITE-DISTANCE OF LK-ACTIVITE
           DISPLAY 'TRANSPORT: ' LK-ACTIVITE-TRANSPORT OF LK-ACTIVITE
           DISPLAY 'HEBERG.  : ' LK-ACTIVITE-HEBERG OF LK-ACTIVITE
           DISPLAY 'REPAS    : ' LK-ACTIVITE-REPAS OF LK-ACTIVITE
           DISPLAY 'EMPREINTE: ' LK-ACTIVITE-EMPREINTE OF LK-ACTIVITE
           DISPLAY '----------------------------------------'
           GOBACK
           .