       IDENTIFICATION DIVISION.
       PROGRAM-ID. HEBERGEMENT-DAL-DB.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
OCESQL*    EXEC SQL INCLUDE SQLCA END-EXEC.
OCESQL     copy "sqlca.cbl".
       01  WS-CONNECTED-FLAG      PIC X VALUE 'N'.
       01  WS-CURSOR-OPEN-FLAG    PIC X VALUE 'N'.
       01  WS-HEBERGEMENT-ID      PIC 9(9).
       01  WS-HEBERG-ID-ACTIVITE  PIC 9(9).
       01  WS-HEBERGEMENT-TYPE    PIC 9(2).
       01  WS-HEBERGEMENT-NBNUIT  PIC S9(3).
       01  WS-DB-NAME             PIC X(64).
       01  WS-DB-USER             PIC X(64).
       01  WS-DB-PASSWORD         PIC X(64).
OCESQL*
OCESQL 01  SQ0001.
OCESQL     02  FILLER PIC X(125) VALUE "SELECT HEBERGEMENT_ID, HEBERGE"
OCESQL  &  "MENT_ID_ACTIVITE, HEBERGEMENT_TYPE, HEBERGEMENT_NBNUIT FRO"
OCESQL  &  "M HEBERGEMENT ORDER BY HEBERGEMENT_ID".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0002.
OCESQL     02  FILLER PIC X(125) VALUE "UPDATE HEBERGEMENT SET HEBERGE"
OCESQL  &  "MENT_ID_ACTIVITE = $1, HEBERGEMENT_TYPE = $2, HEBERGEMENT_"
OCESQL  &  "NBNUIT = $3 WHERE HEBERGEMENT_ID = $4".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0003.
OCESQL     02  FILLER PIC X(014) VALUE "DISCONNECT ALL".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
       LINKAGE SECTION.
       01 LK-OPERATION PIC X(4).
       01 LK-END-OF-FILE PIC X.
       01 LK-HEBERGEMENT.
           05 LK-HEBERGEMENT-ID PIC 9(9).
           05 LK-HEBERGEMENT-ID-ACTIVITE PIC 9(9).
           05 LK-HEBERGEMENT-TYPE PIC 9(2).
           05 LK-HEBERGEMENT-NBNUIT PIC S9(3).
       PROCEDURE DIVISION USING LK-OPERATION LK-END-OF-FILE 
       LK-HEBERGEMENT.
       MAIN-ENTRY.
           EVALUATE LK-OPERATION
               WHEN 'READ'
                   PERFORM DAL-READ
               WHEN 'SAVE'
                   PERFORM DAL-SAVE
               WHEN 'END '
                   PERFORM DAL-END
               WHEN OTHER
                   DISPLAY 'ERREUR: Operation inconnue: ' LK-OPERATION
           END-EVALUATE
           GOBACK.
       
       DAL-SET-ENV.
           ACCEPT WS-DB-USER FROM ENVIRONMENT 'PGUSER'
           ACCEPT WS-DB-PASSWORD FROM ENVIRONMENT 'PGPASSWORD'
           ACCEPT WS-DB-NAME FROM ENVIRONMENT 'PGDATABASE'.
       
       DAL-CONNECT.
           IF WS-CONNECTED-FLAG = 'Y'
               CONTINUE
           ELSE
               PERFORM DAL-SET-ENV
OCESQL*        EXEC SQL
OCESQL*            CONNECT :WS-DB-USER IDENTIFIED BY :WS-DB-PASSWORD
OCESQL*                USING :WS-DB-NAME
OCESQL*        END-EXEC
OCESQL     CALL "OCESQLConnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE WS-DB-USER
OCESQL          BY VALUE 64
OCESQL          BY REFERENCE WS-DB-PASSWORD
OCESQL          BY VALUE 64
OCESQL          BY REFERENCE WS-DB-NAME
OCESQL          BY VALUE 64
OCESQL     END-CALL
               IF SQLCODE < 0
                   DISPLAY 'ERREUR CONNECT: SQLCODE=' SQLCODE
                   DISPLAY 'SQLSTATE=' SQLSTATE
                   DISPLAY 'SQLERRMC=' SQLERRMC
                   STOP RUN
               ELSE
                   DISPLAY 'Connexion DB reussie'
                   MOVE 'Y' TO WS-CONNECTED-FLAG
               END-IF
           END-IF.
       
       DAL-READ.
           PERFORM DAL-CONNECT
           IF WS-CURSOR-OPEN-FLAG NOT EQUAL 'Y'
OCESQL*        EXEC SQL
OCESQL*            DECLARE C_HEB CURSOR FOR
OCESQL*            SELECT HEBERGEMENT_ID, HEBERGEMENT_ID_ACTIVITE,
OCESQL*                   HEBERGEMENT_TYPE, HEBERGEMENT_NBNUIT
OCESQL*            FROM HEBERGEMENT
OCESQL*            ORDER BY HEBERGEMENT_ID
OCESQL*        END-EXEC
OCESQL     CALL "OCESQLCursorDeclare" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "HEBERGEMENT_DAL_DB_C_HEB" & x"00"
OCESQL          BY REFERENCE SQ0001
OCESQL     END-CALL
OCESQL*        EXEC SQL
OCESQL*            OPEN C_HEB
OCESQL*        END-EXEC
OCESQL     CALL "OCESQLCursorOpen" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "HEBERGEMENT_DAL_DB_C_HEB" & x"00"
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR OPEN: SQLCODE=' SQLCODE
                   STOP RUN
               ELSE
                   DISPLAY 'Curseur C_HEB ouvert'
                   MOVE 'Y' TO WS-CURSOR-OPEN-FLAG
               END-IF
           END-IF
           MOVE 'N' TO LK-END-OF-FILE
OCESQL*    EXEC SQL
OCESQL*        FETCH C_HEB INTO
OCESQL*            :WS-HEBERGEMENT-ID,
OCESQL*            :WS-HEBERG-ID-ACTIVITE,
OCESQL*            :WS-HEBERGEMENT-TYPE,
OCESQL*            :WS-HEBERGEMENT-NBNUIT
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERGEMENT-ID
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERG-ID-ACTIVITE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERGEMENT-TYPE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 3
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERGEMENT-NBNUIT
OCESQL     END-CALL
OCESQL     CALL "OCESQLCursorFetchOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "HEBERGEMENT_DAL_DB_C_HEB" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
           EVALUATE SQLCODE
               WHEN 0
                   MOVE WS-HEBERGEMENT-ID TO LK-HEBERGEMENT-ID
                   MOVE WS-HEBERG-ID-ACTIVITE TO 
                   LK-HEBERGEMENT-ID-ACTIVITE
                   MOVE WS-HEBERGEMENT-TYPE TO LK-HEBERGEMENT-TYPE
                   MOVE WS-HEBERGEMENT-NBNUIT TO LK-HEBERGEMENT-NBNUIT
               WHEN 100
                   MOVE 'Y' TO LK-END-OF-FILE
               WHEN OTHER
                   DISPLAY 'ERREUR FETCH: SQLCODE=' SQLCODE
                   MOVE 'Y' TO LK-END-OF-FILE
           END-EVALUATE.
       
       DAL-SAVE.
           PERFORM DAL-CONNECT
           MOVE LK-HEBERGEMENT-ID OF LK-HEBERGEMENT
               TO WS-HEBERGEMENT-ID
           MOVE LK-HEBERGEMENT-ID-ACTIVITE OF LK-HEBERGEMENT
               TO WS-HEBERG-ID-ACTIVITE
           MOVE LK-HEBERGEMENT-TYPE OF LK-HEBERGEMENT
               TO WS-HEBERGEMENT-TYPE
           MOVE LK-HEBERGEMENT-NBNUIT OF LK-HEBERGEMENT
               TO WS-HEBERGEMENT-NBNUIT
OCESQL*    EXEC SQL
OCESQL*        UPDATE HEBERGEMENT
OCESQL*        SET HEBERGEMENT_ID_ACTIVITE = :WS-HEBERG-ID-ACTIVITE,
OCESQL*            HEBERGEMENT_TYPE = :WS-HEBERGEMENT-TYPE,
OCESQL*            HEBERGEMENT_NBNUIT = :WS-HEBERGEMENT-NBNUIT
OCESQL*        WHERE HEBERGEMENT_ID = :WS-HEBERGEMENT-ID
OCESQL*    END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERG-ID-ACTIVITE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERGEMENT-TYPE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 3
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERGEMENT-NBNUIT
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-HEBERGEMENT-ID
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0002
OCESQL          BY VALUE 4
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
           IF SQLCODE NOT EQUAL ZERO
               DISPLAY 'ERREUR UPDATE: SQLCODE=' SQLCODE
           END-IF.
       
       DAL-END.
           IF WS-CURSOR-OPEN-FLAG = 'Y'
OCESQL*        EXEC SQL CLOSE C_HEB END-EXEC
OCESQL     CALL "OCESQLCursorClose"  USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "HEBERGEMENT_DAL_DB_C_HEB" & x"00"
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR CLOSE: SQLCODE=' SQLCODE
               END-IF
               MOVE 'N' TO WS-CURSOR-OPEN-FLAG
           END-IF
           IF WS-CONNECTED-FLAG = 'Y'
               DISPLAY 'Fermeture connexion'
OCESQL*        EXEC SQL COMMIT END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "COMMIT" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR COMMIT: SQLCODE=' SQLCODE
               END-IF
OCESQL*        EXEC SQL DISCONNECT ALL END-EXEC
OCESQL     CALL "OCESQLDisconnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL     END-CALL
               IF SQLCODE NOT EQUAL ZERO
                   DISPLAY 'ERREUR DISCONNECT: SQLCODE=' SQLCODE
               END-IF
               MOVE 'N' TO WS-CONNECTED-FLAG
           END-IF.